#### 📖 Terraform Plan ('infra/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.backoffice.azurerm_monitor_autoscale_setting.backoffice will be created
  + resource "azurerm_monitor_autoscale_setting" "backoffice" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-svc-bo-as-01"
      + resource_group_name = "io-p-itn-svc-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + target_resource_id  = (known after apply)

      + profile {
          + name = "default"

          + capacity {
              + default = 3
              + maximum = 30
              + minimum = 3
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 3000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT1M"
                }
              + scale_action {
                  + cooldown  = "PT1M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 60
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "MemoryPercentage"
                  + metric_namespace   = "microsoft.web/serverfarms"
                  + metric_resource_id = (known after apply)
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 80
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 2000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 30
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "MemoryPercentage"
                  + metric_namespace   = "microsoft.web/serverfarms"
                  + metric_resource_id = (known after apply)
                  + operator           = "LessThan"
                  + statistic          = "Average"
                  + threshold          = 30
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # module.key_vault.azurerm_key_vault_access_policy.managed_identity_infra_cd will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_infra_cd" {
      + certificate_permissions = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Purge",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv"
      + object_id               = "13becd8f-c214-40ed-8e78-eff499bbd94c"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault.azurerm_key_vault_access_policy.managed_identity_infra_ci will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_infra_ci" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv"
      + object_id               = "6dd98eea-3184-4d72-9296-f47248122a2d"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault.azurerm_key_vault_secret.bo_auth_session_secret will be created
  + resource "azurerm_key_vault_secret" "bo_auth_session_secret" {
      + content_type            = "string"
      + expiration_date         = "2028-09-27T07:41:36Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv"
      + name                    = "bo-auth-session-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.backoffice.module.backoffice.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "AI_SDK_CONNECTION_STRING"                        = (sensitive value)
          + "APIM_USER_GROUPS"                                = "apimessagewrite,apiinforead,apimessageread,apilimitedprofileread,apiservicewrite"
          + "API_APIM_MOCKING"                                = "false"
          + "API_SERIVCES_CMS_TOPICS_CACHE_TTL_MINUTES"       = "60"
          + "API_SERVICES_CMS_BASE_PATH"                      = "/api/v1"
          + "API_SERVICES_CMS_MOCKING"                        = "false"
          + "API_SERVICES_CMS_URL"                            = "https://io-p-itn-svc-cms-func-01.azurewebsites.net"
          + "APP_ENV"                                         = "production"
          + "AZURE_APIM"                                      = "io-p-apim-v2-api"
          + "AZURE_APIM_PRODUCT_NAME"                         = "io-services-api"
          + "AZURE_APIM_RESOURCE_GROUP"                       = "io-p-rg-internal"
          + "AZURE_APIM_SUBSCRIPTIONS_API_BASE_URL"           = "https://management.azure.com/subscriptions/"
          + "AZURE_CLIENT_SECRET_CREDENTIAL_CLIENT_ID"        = (sensitive value)
          + "AZURE_CLIENT_SECRET_CREDENTIAL_SECRET"           = (sensitive value)
          + "AZURE_CLIENT_SECRET_CREDENTIAL_TENANT_ID"        = "7788edaf-0346-4068-9d79-c868aed15b3d"
          + "AZURE_CREDENTIALS_SCOPE_URL"                     = "https://management.azure.com/.default"
          + "AZURE_SUBSCRIPTION_ID"                           = "ec285037-c673-4f58-b594-d7c480da4e8b"
          + "BACKOFFICE_HOST"                                 = "selfcare.io.pagopa.it"
          + "COSMOSDB_CONTAINER_SERVICES_LIFECYCLE"           = "services-lifecycle"
          + "COSMOSDB_CONTAINER_SERVICES_PUBLICATION"         = "services-publication"
          + "COSMOSDB_KEY"                                    = (sensitive value)
          + "COSMOSDB_NAME"                                   = "db-services-cms"
          + "COSMOSDB_URI"                                    = "https://io-p-cosmos-services-cms.documents.azure.com:443/"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "IS_MSW_ENABLED"                                  = "false"
          + "LEGACY_COSMOSDB_KEY"                             = (sensitive value)
          + "LEGACY_COSMOSDB_MOCKING"                         = "false"
          + "LEGACY_COSMOSDB_NAME"                            = "db"
          + "LEGACY_COSMOSDB_URI"                             = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "NEXTAUTH_SECRET"                                 = (sensitive value)
          + "NEXTAUTH_URL"                                    = "https://selfcare.io.pagopa.it/"
          + "NODE_ENV"                                        = "production"
          + "SELFCARE_API_KEY"                                = (sensitive value)
          + "SELFCARE_API_MOCKING"                            = "false"
          + "SELFCARE_EXTERNAL_API_BASE_URL"                  = "https://api.selfcare.pagopa.it/external/v2"
          + "SELFCARE_JWKS_PATH"                              = "/.well-known/jwks.json"
          + "SUBSCRIPTION_MIGRATION_API_KEY"                  = (sensitive value)
          + "SUBSCRIPTION_MIGRATION_API_MOCKING"              = "false"
          + "SUBSCRIPTION_MIGRATION_API_URL"                  = "https://io-p-subsmigrations-fn.azurewebsites.net/api/v1"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-svc-bo-app-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-svc-rg-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "APP_ENV",
            ]
        }
    }

  # module.backoffice.module.backoffice.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "AI_SDK_CONNECTION_STRING"                        = (sensitive value)
          + "APIM_USER_GROUPS"                                = "apimessagewrite,apiinforead,apimessageread,apilimitedprofileread,apiservicewrite"
          + "API_APIM_MOCKING"                                = "false"
          + "API_SERIVCES_CMS_TOPICS_CACHE_TTL_MINUTES"       = "60"
          + "API_SERVICES_CMS_BASE_PATH"                      = "/api/v1"
          + "API_SERVICES_CMS_MOCKING"                        = "false"
          + "API_SERVICES_CMS_URL"                            = "https://io-p-itn-svc-cms-func-01.azurewebsites.net"
          + "APP_ENV"                                         = "staging"
          + "AZURE_APIM"                                      = "io-p-apim-v2-api"
          + "AZURE_APIM_PRODUCT_NAME"                         = "io-services-api"
          + "AZURE_APIM_RESOURCE_GROUP"                       = "io-p-rg-internal"
          + "AZURE_APIM_SUBSCRIPTIONS_API_BASE_URL"           = "https://management.azure.com/subscriptions/"
          + "AZURE_CLIENT_SECRET_CREDENTIAL_CLIENT_ID"        = (sensitive value)
          + "AZURE_CLIENT_SECRET_CREDENTIAL_SECRET"           = (sensitive value)
          + "AZURE_CLIENT_SECRET_CREDENTIAL_TENANT_ID"        = "7788edaf-0346-4068-9d79-c868aed15b3d"
          + "AZURE_CREDENTIALS_SCOPE_URL"                     = "https://management.azure.com/.default"
          + "AZURE_SUBSCRIPTION_ID"                           = "ec285037-c673-4f58-b594-d7c480da4e8b"
          + "BACKOFFICE_HOST"                                 = "selfcare.io.pagopa.it"
          + "COSMOSDB_CONTAINER_SERVICES_LIFECYCLE"           = "services-lifecycle"
          + "COSMOSDB_CONTAINER_SERVICES_PUBLICATION"         = "services-publication"
          + "COSMOSDB_KEY"                                    = (sensitive value)
          + "COSMOSDB_NAME"                                   = "db-services-cms"
          + "COSMOSDB_URI"                                    = "https://io-p-cosmos-services-cms.documents.azure.com:443/"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "IS_MSW_ENABLED"                                  = "false"
          + "LEGACY_COSMOSDB_KEY"                             = (sensitive value)
          + "LEGACY_COSMOSDB_MOCKING"                         = "false"
          + "LEGACY_COSMOSDB_NAME"                            = "db"
          + "LEGACY_COSMOSDB_URI"                             = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "NEXTAUTH_SECRET"                                 = (sensitive value)
          + "NEXTAUTH_URL"                                    = "https://selfcare.io.pagopa.it/"
          + "NODE_ENV"                                        = "production"
          + "SELFCARE_API_KEY"                                = (sensitive value)
          + "SELFCARE_API_MOCKING"                            = "false"
          + "SELFCARE_EXTERNAL_API_BASE_URL"                  = "https://api.selfcare.pagopa.it/external/v2"
          + "SELFCARE_JWKS_PATH"                              = "/.well-known/jwks.json"
          + "SUBSCRIPTION_MIGRATION_API_KEY"                  = (sensitive value)
          + "SUBSCRIPTION_MIGRATION_API_MOCKING"              = "false"
          + "SUBSCRIPTION_MIGRATION_API_URL"                  = "https://io-p-subsmigrations-fn.azurewebsites.net/api/v1"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "io-p-itn-svc-bo-staging-app-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }
        }
    }

  # module.backoffice.module.backoffice.azurerm_private_endpoint.app_service_sites will be created
  + resource "azurerm_private_endpoint" "app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-bo-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-bo-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.backoffice.module.backoffice.azurerm_private_endpoint.staging_app_service_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-bo-staging-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-bo-staging-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-io-p-itn-svc-bo-staging-app-01",
            ]
        }
    }

  # module.backoffice.module.backoffice.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-p-itn-svc-bo-asp-01"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-p-itn-svc-rg-01"
      + sku_name                     = "P0v3"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.backoffice.module.backoffice.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.20.11.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-svc-bo-app-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                        = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (91 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01"
        name                                           = "io-p-itn-svc-cms-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                        = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (92 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 10 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
